#Задание №1
one = int(673.3123)
print(one)
#результат >>> 673
two = float(512)
print(two)
#результат >>> 512.0
three = int(float(str(192)))
print(three)
#результат >>> 192
four = float(173) + 5
print(four)
#результат >>> 178.0
five = str(193.000000000001)
print(five)
#результат >>> 193.000000000001



#Задание №2
'Calling ' + str(911)

'abc' + 'xyz'
"""
Конкатенация-это объединение строк 
в первой строке мы изменяем тип данных 911 в стринг так как он интеджер 
и мы не можем объединить стринг с интеджером.
а во второй строке мы просто объединяем две стринги.
"""

#Задание№3
a = 589
b = 932.901
c = 'Hello world'
d = '892.01'
print(a+b, c+d)



#Задание №4
a = "Hello world589"
b = 892.01
c = 932.901589
d = 1481.01
print(a,b,c,d)
